{"pageProps":{"projectName":"Financial Components","currentAdr":{"slug":"20250212-architecture-for-the-icm-error-lookup-tool","package":null,"title":"Architecture for the ICM Error Lookup Tool","status":"proposed","supersededBy":null,"tags":[],"deciders":[],"body":{"enhancedMdx":"\n- **decision-makers:** Zorin Samji, Will Kiiskila\n- **consulted:** Spencer Rose\n- **informed:** Greg Froh, Jeremy Vernon\n\n## Context and Problem Statement\n\nWe need to build a simple web application, the ICM Error Lookup Tool (IET), that allows users to look up Integrated Case Management (ICM) error messages and retrieve helpful information. While the frontend requirements are straightforward, we need to determine the most effective way to manage, serve, store and maintain the error message data. The challenge is avoiding tying the project to existing systems such as Klamm and minimize ongoing maintenance such as database backups.\n\n## Decision Drivers\n\n- Long term maintainability and simplicity of the system\n- Desire to minimize operational maintenance\n- Potential need for system independence from Klamm in the future\n- Ease of data management for managing error message content\n- System reliability and performance\n- Development and maintenance effort required\n\n## Considered Options\n\n1. **JSON Export Architecture:** Use Klamm for data management with automated JSON export process\n2. **Direct Klamm Integration:** Use existing Klamm (Laravel/Filament/Postgres Web Application) to manage IET data\n3. **Dedicated Klamm Instance:** Create a new version of Klamm specifically for IET\n4. **Independent System:** Create a separate dedicated backend/database for IET\n\n## Decision Outcome\n\nChosen option: **\"JSON Export Architecture\" (Option 1)**, because it balances simplicity, ease of maintainability and independence from outside systems. The goal is to use Klamm to manage the data but we export the data the IET uses so it can operate independently from Klamm. This also minimizes maintenance and in the event the system data should be decoupled from Klamm it can be done easily.\n\n### Pros and Cons\n\n- Good, because it uses existing Klamm infrastructure for data management\n- Good, because it maintains a clear separation between data management and presentation\n- Good, because it eliminates the need for maintaining a separate database system\n- Good, because it enables future flexibility to switch data sources without affecting the frontend\n- Good, because it simplifies deployment and reduces operational complexity\n- Bad, because it introduces a build/deploy step in the data update process\n- Bad, because it may have slightly slower data update cycles compared to direct database access\n- Bad, because it requires setting up and maintaining GitHub Actions for the export process\n\n## Pros and Cons of the Other Options\n\n### Direct Klamm Integration (Option 2)\n\nUsing the existing Klamm system directly to manage and serve IET data.\n\n- Good, because it requires minimal initial development effort\n- Good, because Klamm has long term support\n- Good, because it leverages existing infrastructure and tools\n- Bad, because it creates a reliance on Klamm for managing data\n- Bad, because IET will always need a live connection to Klamm to function\n\n### Dedicated Klamm Instance (Option 3)\n\nCreating a new instance of Klamm specifically for IET.\n\n- Good, because it provides system independence\n- Good, because it uses familiar tools\n- Bad, because Klamm has been directed to not be split but exist as one tool for multiple teams\n- Bad, because it requires maintaining a separate Klamm instance\n- Bad, because it duplicates infrastructure unnecessarily\n\n### Independent System (Option 4)\n\nCreating a completely separate backend and database for IET.\n\n- Good, because it provides complete system independence\n- Good, because it can be optimized specifically for IET needs\n- Bad, because it requires more development effort\n- Bad, because it requires separate database maintenance and backups\n- Bad, because it adds unnecessary complexity for a simple use case\n- Bad, because we are adding data that could be in Klamm in an additional location\n\n### Confirmation\n\nThe implementation of the \"JSON Export Architecture\" (Option 1), can be confirmed through:\n\n1. Successful setup of the JSON export process from Klamm\n2. Verification of the GitHub Actions workflow for automated data updates\n3. Unit test and end-to-end testing of the entire process\n4. Documentation review of the data update process\n\n## More Information\n\nThe JSON export architecture provides an approach that balances our immediate needs with future flexibility. We also have the need to send feedback to Klamm or another system. All the approaches can handle this need in different ways. For a long term solution of gathering feedback across multiple systems we should look at tools purpose built for that rather than adapting Klamm further to handle that use case.\n"},"creationDate":"2025-02-12T18:32:23.000Z","lastEditDate":"2025-02-14T17:32:18.000Z","lastEditAuthor":"Will Kiiskila","publicationDate":"2025-02-14T07:59:59.000Z","file":{"relativePath":"docs/adr/20250212-architecture-for-the-icm-error-lookup-tool.md","absolutePath":"/home/runner/work/fc-madr/fc-madr/docs/adr/20250212-architecture-for-the-icm-error-lookup-tool.md"},"repository":{"provider":"github","viewUrl":"https://github.com/kiiskila-bcgov/fc-madr/blob/master/docs/adr/20250212-architecture-for-the-icm-error-lookup-tool.md"}},"l4bVersion":"1.1.0"},"__N_SSG":true}